app/views/category/cart_show.html.erb

        <div class="cart-item">
          <%= image_tag(cart_item.product.product_image.url, alt: cart_item.product.product_name, size: '80x80') if cart_item.product.product_image.present? %>
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IN (2, 4)