app/views/category/index.html.erb

        <div class="product">
          <%= image_tag(product.product_image.url, alt: product.product_name, size: '256x256', class: "product-image") if product.product_image.present? %>
---
SELECT `products`.* FROM `products`