app/controllers/category_controller.rb

  def create_product
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO `products` (`product_name`, `product_price`, `product_description`, `product_image_file_name`, `product_image_content_type`, `product_image_file_size`, `product_image_updated_at`, `created_at`, `updated_at`) VALUES ('vjhk', 758, 'zxgfhcgjvhkbjlnk', 'Screenshot_from_2023-10-12_15-22-06.png', 'image/png', 170117, '2024-01-22 04:33:11', '2024-01-22 04:33:12.389026', '2024-01-22 04:33:12.389026')

  def add_to_cart_product
    product = Product.find(params[:id])
    quantity = 1

    # Check if the product is already in the user's cart
    cart_item = current_user.cart_items.find_by(product_id: product.id)

    if cart_item
      # If the product is in the cart, update the quantity
      cart_item.update(quantity: cart_item.quantity + quantity)
    else
      # If the product is not in the cart, create a new cart item
      current_user.cart_items.create(product_id: product.id, quantity: quantity)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`user_id` = 1 AND `cart_items`.`product_id` = 2 LIMIT 1
UPDATE `cart_items` SET `cart_items`.`quantity` = 2, `cart_items`.`updated_at` = '2024-01-22 04:01:32.064056' WHERE `cart_items`.`id` = 1
INSERT INTO `cart_items` (`user_id`, `product_id`, `created_at`, `updated_at`) VALUES (1, 4, '2024-01-19 04:56:30.174237', '2024-01-19 04:56:30.174237')

  def search
    @products = Product.where("product_name LIKE ?", "%#{params[:query]}%")
---
SELECT `products`.* FROM `products` WHERE (product_name LIKE '%dewf%')

  def cart_show
    @cart_items = current_user.cart_items.includes(:product)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IN (2, 4)
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`user_id` = 1

  def calculate_cart_total(cart_items)
    cart_items.sum { |item| item.quantity * item.product.product_price }
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IN (2, 4)